cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

brew 'nvm'
brew 'diff-so-fancy'
brew 'fasd'
brew 'ffmpeg', args: ['with-libass', 'with-fontconfig']
brew 'giflossy'
brew 'git'
brew 'git-standup'
brew 'gnupg'
brew 'imagemagick', args: ['with-fontconfig']
brew 'jenv'
brew 'pyenv'
brew 'rbenv'
brew 'sbt'
brew 'scala'
brew 'tree'
brew 'zsh'

# Just for fun
brew 'cowsay'
brew 'fortune'

cask 'alfred'
cask 'atom'
cask 'calibre'
cask 'dash'
cask 'docker'
cask 'evernote'
cask 'firefox'
cask 'flux'
cask 'google-drive'
cask 'gitify'
cask 'google-chrome'
cask 'hyper'
cask 'iterm2'
cask 'kap'
cask 'macdown'
cask 'scratch'
cask 'screenhero'
cask 'skitch'
cask 'skype'
cask 'slack'
cask 'spectacle'
cask 'spotify'
cask 'spotify-notifications'
cask 'sublime-text'
cask 'visual-studio-code'
cask 'whatsapp'
