cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'

brew 'deno'
brew 'diff-so-fancy'
brew 'fasd'
brew 'gh'
brew 'git'
brew 'nvm'
brew 'pyenv'
brew 'rbenv'
brew 'zsh'

cask '1password'
cask 'chromium'
cask 'cron'
cask 'google-chrome'
cask 'grammarly'
cask 'insomnia'
cask 'iterm2'
cask 'notion'
cask 'obsidian'
cask 'raindropio'
cask 'raycast'
cask 'rectangle'
cask 'rocket'
cask 'slack'
cask 'spotify'
cask 'todoist'
cask 'visual-studio-code'
cask 'whatsapp'
cask 'zoom'
